pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * Copyright 2024-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 25.06.10
external_user_signals: {}
pin_labels:
- {pin_num: B1, pin_signal: GPIO_AON_08, label: LPUART1_TX, identifier: LPUART1_TX}
- {pin_num: A5, pin_signal: GPIO_AON_09, label: LPUART1_RX, identifier: LPUART1_RX}
- {pin_num: U7, pin_signal: GPIO_EMC_B2_17, label: RXD0, identifier: NETC_ENETC0_RXD0}
- {pin_num: P8, pin_signal: GPIO_EMC_B2_18, label: RXD1, identifier: NETC_ENETC0_RXD1}
- {pin_num: U6, pin_signal: GPIO_EMC_B2_10, label: RXD2, identifier: NETC_ENETC0_RXD2}
- {pin_num: U5, pin_signal: GPIO_EMC_B2_09, label: RXD3, identifier: NETC_ENETC0_RXD3}
- {pin_num: U8, pin_signal: GPIO_EMC_B2_19, label: RXEN, identifier: NETC_ENETC0_RXEN}
- {pin_num: U4, pin_signal: GPIO_EMC_B2_08, label: RXCLK, identifier: NETC_ENETC0_RXCLK}
- {pin_num: R6, pin_signal: GPIO_EMC_B2_13, label: TXD0, identifier: NETC_ENETC0_TXD0}
- {pin_num: N8, pin_signal: GPIO_EMC_B2_14, label: TXD1, identifier: NETC_ENETC0_TXD1}
- {pin_num: R5, pin_signal: GPIO_EMC_B2_12, label: TXD2, identifier: NETC_ENETC0_TXD2}
- {pin_num: P6, pin_signal: GPIO_EMC_B2_11, label: TXD3, identifier: NETC_ENETC0_TXD3}
- {pin_num: R4, pin_signal: GPIO_EMC_B2_15, label: TXEN, identifier: NETC_ENETC0_TXEN}
- {pin_num: R7, pin_signal: GPIO_EMC_B2_16, label: TXCLK, identifier: NETC_ENETC0_TXCLK}
- {pin_num: K2, pin_signal: GPIO_EMC_B1_02, label: RXCLK, identifier: NETC_SWT_ETH3_RXCLK;ECAT_PT0_RXCLK}
- {pin_num: E1, pin_signal: GPIO_EMC_B1_09, label: RXD0, identifier: NETC_SWT_ETH3_RXD0;ECAT_PT0_RXD0}
- {pin_num: E3, pin_signal: GPIO_EMC_B1_10, label: RXD1, identifier: NETC_SWT_ETH3_RXD1;ECAT_PT0_RXD1}
- {pin_num: J4, pin_signal: GPIO_EMC_B1_04, label: RXD2, identifier: NETC_SWT_ETH3_RXD2;ECAT_PT0_RXD2}
- {pin_num: G3, pin_signal: GPIO_EMC_B1_03, label: RXD3, identifier: NETC_SWT_ETH3_RXD3;ECAT_PT0_RXD3}
- {pin_num: F2, pin_signal: GPIO_EMC_B1_11, label: RXEN, identifier: NETC_SWT_ETH3_RXEN;ECAT_PT0_RXEN}
- {pin_num: H5, pin_signal: GPIO_EMC_B1_08, label: TXCLK, identifier: NETC_SWT_ETH3_TXCLK;ECAT_PT0_TXCLK}
- {pin_num: H6, pin_signal: GPIO_EMC_B1_05, label: TXD0, identifier: NETC_SWT_ETH3_TXD0;ECAT_PT0_TXD0}
- {pin_num: K3, pin_signal: GPIO_EMC_B1_06, label: TXD1, identifier: NETC_SWT_ETH3_TXD1;ECAT_PT0_TXD1}
- {pin_num: H4, pin_signal: GPIO_EMC_B1_01, label: TXD2, identifier: NETC_SWT_ETH3_TXD2;ECAT_PT0_TXD2}
- {pin_num: H3, pin_signal: GPIO_EMC_B1_00, label: TXD3, identifier: NETC_SWT_ETH3_TXD3;ECAT_PT0_TXD3}
- {pin_num: M3, pin_signal: GPIO_EMC_B1_07, label: TXEN, identifier: NETC_SWT_ETH3_TXEN;ECAT_PT0_TXEN}
- {pin_num: B8, pin_signal: GPIO_B2_13, label: RXCLK, identifier: NETC_SWT_ETH2_RXCLK;ECAT_PT1_RXCLK}
- {pin_num: A10, pin_signal: GPIO_B2_10, label: RXD0, identifier: NETC_SWT_ETH2_RXD0;ECAT_PT1_RXD0}
- {pin_num: B9, pin_signal: GPIO_B2_11, label: RXD1, identifier: NETC_SWT_ETH2_RXD1;ECAT_PT1_RXD1}
- {pin_num: C10, pin_signal: GPIO_B2_02, label: RXD2, identifier: NETC_SWT_ETH2_RXD2;ECAT_PT1_RXD2}
- {pin_num: D9, pin_signal: GPIO_B2_03, label: RXD3, identifier: NETC_SWT_ETH2_RXD3;ECAT_PT1_RXD3}
- {pin_num: A8, pin_signal: GPIO_B2_12, label: RXEN, identifier: NETC_SWT_ETH2_RXEN;ECAT_PT1_RXEN}
- {pin_num: D10, pin_signal: GPIO_B2_09, label: TXCLK, identifier: NETC_SWT_ETH2_TXCLK;ECAT_PT1_TXCLK}
- {pin_num: E8, pin_signal: GPIO_B2_06, label: TXD0, identifier: NETC_SWT_ETH2_TXD0;ECAT_PT1_TXD0}
- {pin_num: A6, pin_signal: GPIO_B2_07, label: TXD1, identifier: NETC_SWT_ETH2_TXD1;ECAT_PT1_TXD1}
- {pin_num: C9, pin_signal: GPIO_B2_04, label: TXD2, identifier: NETC_SWT_ETH2_TXD2;ECAT_PT1_TXD2}
- {pin_num: A9, pin_signal: GPIO_B2_05, label: TXD3, identifier: NETC_SWT_ETH2_TXD3;ECAT_PT1_TXD3}
- {pin_num: A7, pin_signal: GPIO_B2_08, label: TXEN, identifier: NETC_SWT_ETH2_TXEN;ECAT_PT1_TX_EN}
- {pin_num: L17, pin_signal: GPIO_AD_30, label: EMDC, identifier: NETC_ETH2_ETH3_EMDC;ECAT_PT0_PT1_EMDC;ECAT_PT0_PT1}
- {pin_num: K17, pin_signal: GPIO_AD_31, label: EMDIO, identifier: NETC_ETH2_ETH3_EMDIO;NECAT_PT0_PT1_EMDIO;ECAT_PT0_PT1_EMDIO}
- {pin_num: D14, pin_signal: GPIO_SD_B1_02, label: RESET, identifier: NETC_ETH2_RESET;NETC_ETH2_ETH3_RESET;PHY_Reset;ECAT_PT0_PT1_RESET}
- {pin_num: N5, pin_signal: GPIO_EMC_B2_00, label: EMDC, identifier: NETC_EMDC;NETC_ETH4_EMDC}
- {pin_num: R2, pin_signal: GPIO_EMC_B2_01, label: EMDIO, identifier: NETC_EMDIO;NETC_ETH4_EMDIO}
- {pin_num: T5, pin_signal: GPIO_EMC_B2_03, label: RESET, identifier: NETC_ETH4_RESET}
- {pin_num: D5, pin_signal: GPIO_AON_19, label: LPUART1_CTS, identifier: LPUART1_CTS}
- {pin_num: E5, pin_signal: GPIO_AON_20, label: LPUART1_RTS, identifier: LPUART1_RTS}
- {pin_num: E10, pin_signal: GPIO_B2_01, label: RXER, identifier: ECAT_PT1_RXER}
- {pin_num: G6, pin_signal: GPIO_EMC_B1_12, label: RXER, identifier: ECAT_PT0_RXER}
- {pin_num: P1, pin_signal: GPIO_EMC_B1_39, label: FLEXSPI2_A_SS0_B, identifier: FLEXSPI2_A_SS0_B}
- {pin_num: R1, pin_signal: GPIO_EMC_B1_41, label: FLEXSPI2_A_SCLK, identifier: FLEXSPI2_A_SCLK}
- {pin_num: L2, pin_signal: GPIO_EMC_B1_34, label: FLEXSPI2_B_SCLK, identifier: FLEXSPI2_B_SCLK}
- {pin_num: N2, pin_signal: GPIO_EMC_B1_40, label: FLEXSPI2_A_DQS, identifier: FLEXSPI2_A_DQS}
- {pin_num: L1, pin_signal: GPIO_EMC_B1_35, label: FLEXSPI2_A_D0, identifier: FLEXSPI2_A_D0}
- {pin_num: M1, pin_signal: GPIO_EMC_B1_36, label: FLEXSPI2_A_D1, identifier: FLEXSPI2_A_D1}
- {pin_num: N1, pin_signal: GPIO_EMC_B1_37, label: FLEXSPI2_A_D2, identifier: FLEXSPI2_A_D2}
- {pin_num: M2, pin_signal: GPIO_EMC_B1_38, label: FLEXSPI2_A_D3, identifier: FLEXSPI2_A_D3}
- {pin_num: K1, pin_signal: GPIO_EMC_B1_33, label: FLEXSPI2_B_D0, identifier: FLEXSPI2_B_D0}
- {pin_num: J1, pin_signal: GPIO_EMC_B1_32, label: FLEXSPI2_B_D1, identifier: FLEXSPI2_B_D1}
- {pin_num: J2, pin_signal: GPIO_EMC_B1_31, label: FLEXSPI2_B_D2, identifier: FLEXSPI2_B_D2}
- {pin_num: H2, pin_signal: GPIO_EMC_B1_30, label: FLEXSPI2_B_D3, identifier: FLEXSPI2_B_D3}
- {pin_num: E6, pin_signal: GPIO_AON_18, label: CAN1_STBY, identifier: CAN1_STBY}
- {pin_num: C5, pin_signal: GPIO_AON_16, label: CAN1_TX, identifier: CAN1_TX}
- {pin_num: D6, pin_signal: GPIO_AON_17, label: CAN1_RX, identifier: CAN1_RX}
- {pin_num: B3, pin_signal: GPIO_AON_15, label: LED_GREEN, identifier: LED_GREEN}
- {pin_num: D2, pin_signal: GPIO_AON_25, label: LED_BLUE, identifier: LED_BLUE}
- {pin_num: C8, pin_signal: GPIO_AON_03, label: LED_RED, identifier: LED_RED}
- {pin_num: A16, pin_signal: GPIO_SD_B1_05, label: USER_BUTTON, identifier: USER_BUTTON}
- {pin_num: K4, pin_signal: GPIO_EMC_B1_21, label: DIGITAL_OUTPUT_01, identifier: DIGITAL_OUTPUT_01}
- {pin_num: L3, pin_signal: GPIO_EMC_B1_22, label: DIGITAL_OUTPUT_02, identifier: DIGITAL_OUTPUT_02}
- {pin_num: F1, pin_signal: GPIO_EMC_B1_23, label: DIGITAL_OUTPUT_03, identifier: DIGITAL_OUTPUT_03}
- {pin_num: P2, pin_signal: GPIO_EMC_B1_24, label: DIGITAL_OUTPUT_04, identifier: DIGITAL_OUTPUT_04}
- {pin_num: N3, pin_signal: GPIO_EMC_B1_25, label: DIGITAL_OUTPUT_05, identifier: DIGITAL_OUTPUT_05}
- {pin_num: N4, pin_signal: GPIO_EMC_B1_26, label: DIGITAL_OUTPUT_06, identifier: DIGITAL_OUTPUT_06}
- {pin_num: J3, pin_signal: GPIO_EMC_B1_27, label: DIGITAL_OUTPUT_07, identifier: DIGITAL_OUTPUT_07}
- {pin_num: F5, pin_signal: GPIO_EMC_B1_28, label: DIGITAL_OUTPUT_08, identifier: DIGITAL_OUTPUT_08}
- {pin_num: C2, pin_signal: GPIO_AON_23, label: AFE_RST_B, identifier: AFE_RST_B}
- {pin_num: C1, pin_signal: GPIO_AON_24, label: AFE_INT_B, identifier: AFE_INT_B}
- {pin_num: C7, pin_signal: GPIO_AON_05, label: GPIO1_IO5, identifier: AFE_SPI_CSB;AFE_CS}
- {pin_num: B4, pin_signal: GPIO_AON_04, label: LPSPI1_SCK, identifier: AFE_SPI_SCK}
- {pin_num: E7, pin_signal: GPIO_AON_06, label: LPSPI1_SDO, identifier: AFE_SPI_MOSI}
- {pin_num: C6, pin_signal: GPIO_AON_07, label: LPSPI1_SDI, identifier: AFE_SPI_MISO}
- {pin_num: C3, pin_signal: GPIO_AON_22, label: AFE_DRDY, identifier: AFE_DRDY}
- {pin_num: M14, pin_signal: GPIO_AD_26, label: FLEXPWM_2_1A, identifier: FLEXPWM_2_PWM1A;FLEXPWM_2_1A}
- {pin_num: M16, pin_signal: GPIO_AD_27, label: FLEXPWM_2_1B, identifier: FLEXPWM_2_1B}
- {pin_num: L16, pin_signal: GPIO_AD_28, label: FLEXPWM_2_2B, identifier: FLEXPWM_2_2B}
- {pin_num: L15, pin_signal: GPIO_AD_29, label: FLEXPWM_2_2A, identifier: FLEXPWM_2_2A}
- {pin_num: K16, pin_signal: GPIO_AD_18, label: ECAT_SCL, identifier: ECAT_SCL}
- {pin_num: L13, pin_signal: GPIO_AD_19, label: ECAT_SDA, identifier: ECAT_SDA}
- {pin_num: N16, pin_signal: GPIO_AD_15, label: GPIO4_IO15, identifier: AFE_SYNC;AFE_DRDY}
- {pin_num: N17, pin_signal: GPIO_AD_16, label: LINK_MII, identifier: AFE_DRDY;ECAT_PT0_LINK_MII}
- {pin_num: C15, pin_signal: GPIO_SD_B1_03, label: GPIO5_IO7, identifier: AFE_RST;AFE_SYNC}
- {pin_num: M17, pin_signal: GPIO_AD_17, label: LINK_MII, identifier: ECAT_PT1_LINK_MII}
- {pin_num: A11, pin_signal: GPIO_B1_12, label: DIGITAL_INPUT_01, identifier: DIGITAL_INPUT_01}
- {pin_num: B14, pin_signal: GPIO_B1_08, label: DIGITAL_INPUT_02, identifier: DIGITAL_INPUT_02}
- {pin_num: D13, pin_signal: GPIO_B1_07, label: DIGITAL_INPUT_03, identifier: DIGITAL_INPUT_03}
- {pin_num: B11, pin_signal: GPIO_B1_13, label: DIGITAL_INPUT_04, identifier: DIGITAL_INPUT_04}
- {pin_num: B10, pin_signal: GPIO_B1_06, label: DIGITAL_INPUT_05, identifier: DIGITAL_INPUT_05}
- {pin_num: A15, pin_signal: GPIO_B1_09, label: DIGITAL_INPUT_06, identifier: DIGITAL_INPUT_06}
- {pin_num: A13, pin_signal: GPIO_B1_10, label: DIGITAL_INPUT_07, identifier: DIGITAL_INPUT_07}
- {pin_num: A12, pin_signal: GPIO_B1_11, label: GPIO6_IO11, identifier: AFE_DRDY}
- {pin_num: B15, pin_signal: GPIO_SD_B1_04, label: GPIO5_IO8, identifier: LED_BLUE;AFE_RSTB;AFE_RST}
- {pin_num: B5, pin_signal: GPIO_AON_10, label: LED_BLUE, identifier: LED_BLUE}
- {pin_num: E9, pin_signal: GPIO_B2_00, label: USER_BUTTON, identifier: USER_BUTTON}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_rgpio.h"
#include "pin_mux.h"

