pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_Init_LPUART1_RS485_Pins();
    BOARD_Init_NETC_ENETC0_ETH4_RGMII_Pins();
    BOARD_Init_NETC_ENETC0_ETH4_PHY_Config_Pins();
    BOARD_Init_FlexSPI2_HYPERRAM_Pins();
    BOARD_Init_LED_BUTTON_Pins();
    BOARD_Init_Digital_Input_Pins();
    BOARD_Init_Digital_Output_Pins();
    BOARD_Init_AFE_Pins();
    BOARD_Init_PWM_Pins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_LPUART1_RS485_Pins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: D5, peripheral: LPUART1, signal: CTS_B, pin_signal: GPIO_AON_19, software_input_on: Disable, pull_up_down_config: Pull_Up, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: E5, peripheral: LPUART1, signal: RTS_B, pin_signal: GPIO_AON_20, software_input_on: Disable, pull_up_down_config: Pull_Up, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: A5, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_LPUART1_RS485_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_LPUART1_RS485_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_19_LPUART1_CTS_B,       /* GPIO_AON_19 is configured as LPUART1_CTS_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_20_LPUART1_RTS_B,       /* GPIO_AON_20 is configured as LPUART1_RTS_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_19_LPUART1_CTS_B,       /* GPIO_AON_19 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_20_LPUART1_RTS_B,       /* GPIO_AON_20 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_NETC_ENETC0_ETH4_RGMII_Pins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: U7, peripheral: NETC_ENETC0_ETH4, signal: 'RX_DATA, 0', pin_signal: GPIO_EMC_B2_17, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: P8, peripheral: NETC_ENETC0_ETH4, signal: 'RX_DATA, 1', pin_signal: GPIO_EMC_B2_18, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: U6, peripheral: NETC_ENETC0_ETH4, signal: 'RX_DATA, 2', pin_signal: GPIO_EMC_B2_10, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: U5, peripheral: NETC_ENETC0_ETH4, signal: 'RX_DATA, 3', pin_signal: GPIO_EMC_B2_09, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: U8, peripheral: NETC_ENETC0_ETH4, signal: RX_EN, pin_signal: GPIO_EMC_B2_19, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: U4, peripheral: NETC_ENETC0_ETH4, signal: RX_CLK, pin_signal: GPIO_EMC_B2_08, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: R6, peripheral: NETC_ENETC0_ETH4, signal: 'TX_DATA, 0', pin_signal: GPIO_EMC_B2_13, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: N8, peripheral: NETC_ENETC0_ETH4, signal: 'TX_DATA, 1', pin_signal: GPIO_EMC_B2_14, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: R5, peripheral: NETC_ENETC0_ETH4, signal: 'TX_DATA, 2', pin_signal: GPIO_EMC_B2_12, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: P6, peripheral: NETC_ENETC0_ETH4, signal: 'TX_DATA, 3', pin_signal: GPIO_EMC_B2_11, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: R4, peripheral: NETC_ENETC0_ETH4, signal: TX_EN, pin_signal: GPIO_EMC_B2_15, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: R7, peripheral: NETC_ENETC0_ETH4, signal: TX_CLK, pin_signal: GPIO_EMC_B2_16, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

