pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_NETC_ENETC0_ETH4_PHY_Config_Pins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: N5, peripheral: NETC, signal: netc_emdc, pin_signal: GPIO_EMC_B2_00, identifier: NETC_ETH4_EMDC, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: R2, peripheral: NETC, signal: netc_emdio, pin_signal: GPIO_EMC_B2_01, identifier: NETC_ETH4_EMDIO, software_input_on: Disable, pull_down_pull_up_config: Pull_Up,
    pdrv_config: High_Driver, open_drain: Enable}
  - {pin_num: T5, peripheral: RGPIO3, signal: 'gpio_io, 13', pin_signal: GPIO_EMC_B2_03, direction: OUTPUT, gpio_init_state: 'true', software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_NETC_ENETC0_ETH4_PHY_Config_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_NETC_ENETC0_ETH4_PHY_Config_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of NETC_ETH4_RESET on GPIO_EMC_B2_03 (pin T5) */
  rgpio_pin_config_t NETC_ETH4_RESET_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 1U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_03 (pin T5) */
  RGPIO_PinInit(RGPIO3, 13U, &NETC_ETH4_RESET_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_00_NETC_EMDC,        /* GPIO_EMC_B2_00 is configured as NETC_EMDC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_01_NETC_EMDIO,       /* GPIO_EMC_B2_01 is configured as NETC_EMDIO */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_03_GPIO3_IO13,       /* GPIO_EMC_B2_03 is configured as GPIO3_IO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_00_NETC_EMDC,        /* GPIO_EMC_B2_00 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_01_NETC_EMDIO,       /* GPIO_EMC_B2_01 PAD functional properties : */
      0x14U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Enabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_03_GPIO3_IO13,       /* GPIO_EMC_B2_03 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_NETC_SWT_ETH3_RGMII_Pins:
- options: {callFromInitBoot: 'false', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: K2, peripheral: NETC_SWT_ETH3, signal: RX_CLK, pin_signal: GPIO_EMC_B1_02, identifier: NETC_SWT_ETH3_RXCLK, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: E1, peripheral: NETC_SWT_ETH3, signal: 'RX_DATA, 0', pin_signal: GPIO_EMC_B1_09, identifier: NETC_SWT_ETH3_RXD0, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: E3, peripheral: NETC_SWT_ETH3, signal: 'RX_DATA, 1', pin_signal: GPIO_EMC_B1_10, identifier: NETC_SWT_ETH3_RXD1, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: J4, peripheral: NETC_SWT_ETH3, signal: 'RX_DATA, 2', pin_signal: GPIO_EMC_B1_04, identifier: NETC_SWT_ETH3_RXD2, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: G3, peripheral: NETC_SWT_ETH3, signal: 'RX_DATA, 3', pin_signal: GPIO_EMC_B1_03, identifier: NETC_SWT_ETH3_RXD3, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: F2, peripheral: NETC_SWT_ETH3, signal: RX_EN, pin_signal: GPIO_EMC_B1_11, identifier: NETC_SWT_ETH3_RXEN, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: H5, peripheral: NETC_SWT_ETH3, signal: TX_CLK, pin_signal: GPIO_EMC_B1_08, identifier: NETC_SWT_ETH3_TXCLK, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: H6, peripheral: NETC_SWT_ETH3, signal: 'TX_DATA, 0', pin_signal: GPIO_EMC_B1_05, identifier: NETC_SWT_ETH3_TXD0, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: K3, peripheral: NETC_SWT_ETH3, signal: 'TX_DATA, 1', pin_signal: GPIO_EMC_B1_06, identifier: NETC_SWT_ETH3_TXD1, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: H4, peripheral: NETC_SWT_ETH3, signal: 'TX_DATA, 2', pin_signal: GPIO_EMC_B1_01, identifier: NETC_SWT_ETH3_TXD2, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: H3, peripheral: NETC_SWT_ETH3, signal: 'TX_DATA, 3', pin_signal: GPIO_EMC_B1_00, identifier: NETC_SWT_ETH3_TXD3, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: M3, peripheral: NETC_SWT_ETH3, signal: TX_EN, pin_signal: GPIO_EMC_B1_07, identifier: NETC_SWT_ETH3_TXEN, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

