pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_NETC_SWT_ETH3_RGMII_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_NETC_SWT_ETH3_RGMII_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_NETC_PINMUX_ETH3_TXD03,  /* GPIO_EMC_B1_00 is configured as NETC_PINMUX_ETH3_TXD03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_NETC_PINMUX_ETH3_TXD02,  /* GPIO_EMC_B1_01 is configured as NETC_PINMUX_ETH3_TXD02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_NETC_PINMUX_ETH3_RX_CLK,  /* GPIO_EMC_B1_02 is configured as NETC_PINMUX_ETH3_RX_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_03_NETC_PINMUX_ETH3_RXD03,  /* GPIO_EMC_B1_03 is configured as NETC_PINMUX_ETH3_RXD03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_NETC_PINMUX_ETH3_RXD02,  /* GPIO_EMC_B1_04 is configured as NETC_PINMUX_ETH3_RXD02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_05_NETC_PINMUX_ETH3_TXD00,  /* GPIO_EMC_B1_05 is configured as NETC_PINMUX_ETH3_TXD00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_06_NETC_PINMUX_ETH3_TXD01,  /* GPIO_EMC_B1_06 is configured as NETC_PINMUX_ETH3_TXD01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_07_NETC_PINMUX_ETH3_TX_EN,  /* GPIO_EMC_B1_07 is configured as NETC_PINMUX_ETH3_TX_EN */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_08_NETC_PINMUX_ETH3_TX_CLK,  /* GPIO_EMC_B1_08 is configured as NETC_PINMUX_ETH3_TX_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_09_NETC_PINMUX_ETH3_RXD00,  /* GPIO_EMC_B1_09 is configured as NETC_PINMUX_ETH3_RXD00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_10_NETC_PINMUX_ETH3_RXD01,  /* GPIO_EMC_B1_10 is configured as NETC_PINMUX_ETH3_RXD01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_11_NETC_PINMUX_ETH3_RX_DV,  /* GPIO_EMC_B1_11 is configured as NETC_PINMUX_ETH3_RX_DV */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_00_NETC_PINMUX_ETH3_TXD03,  /* GPIO_EMC_B1_00 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_01_NETC_PINMUX_ETH3_TXD02,  /* GPIO_EMC_B1_01 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_02_NETC_PINMUX_ETH3_RX_CLK,  /* GPIO_EMC_B1_02 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_03_NETC_PINMUX_ETH3_RXD03,  /* GPIO_EMC_B1_03 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_04_NETC_PINMUX_ETH3_RXD02,  /* GPIO_EMC_B1_04 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_05_NETC_PINMUX_ETH3_TXD00,  /* GPIO_EMC_B1_05 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_06_NETC_PINMUX_ETH3_TXD01,  /* GPIO_EMC_B1_06 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_07_NETC_PINMUX_ETH3_TX_EN,  /* GPIO_EMC_B1_07 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_08_NETC_PINMUX_ETH3_TX_CLK,  /* GPIO_EMC_B1_08 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_09_NETC_PINMUX_ETH3_RXD00,  /* GPIO_EMC_B1_09 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_10_NETC_PINMUX_ETH3_RXD01,  /* GPIO_EMC_B1_10 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_11_NETC_PINMUX_ETH3_RX_DV,  /* GPIO_EMC_B1_11 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


