pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_NETC_SWT_ETH2_RGMII_Pins:
- options: {callFromInitBoot: 'false', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: B8, peripheral: NETC_SWT_ETH2, signal: RX_CLK, pin_signal: GPIO_B2_13, identifier: NETC_SWT_ETH2_RXCLK, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A10, peripheral: NETC_SWT_ETH2, signal: 'RX_DATA, 0', pin_signal: GPIO_B2_10, identifier: NETC_SWT_ETH2_RXD0, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: B9, peripheral: NETC_SWT_ETH2, signal: 'RX_DATA, 1', pin_signal: GPIO_B2_11, identifier: NETC_SWT_ETH2_RXD1, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: C10, peripheral: NETC_SWT_ETH2, signal: 'RX_DATA, 2', pin_signal: GPIO_B2_02, identifier: NETC_SWT_ETH2_RXD2, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: D9, peripheral: NETC_SWT_ETH2, signal: 'RX_DATA, 3', pin_signal: GPIO_B2_03, identifier: NETC_SWT_ETH2_RXD3, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A8, peripheral: NETC_SWT_ETH2, signal: RX_EN, pin_signal: GPIO_B2_12, identifier: NETC_SWT_ETH2_RXEN, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: D10, peripheral: NETC_SWT_ETH2, signal: TX_CLK, pin_signal: GPIO_B2_09, identifier: NETC_SWT_ETH2_TXCLK, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: E8, peripheral: NETC_SWT_ETH2, signal: 'TX_DATA, 0', pin_signal: GPIO_B2_06, identifier: NETC_SWT_ETH2_TXD0, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A6, peripheral: NETC_SWT_ETH2, signal: 'TX_DATA, 1', pin_signal: GPIO_B2_07, identifier: NETC_SWT_ETH2_TXD1, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: C9, peripheral: NETC_SWT_ETH2, signal: 'TX_DATA, 2', pin_signal: GPIO_B2_04, identifier: NETC_SWT_ETH2_TXD2, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A9, peripheral: NETC_SWT_ETH2, signal: 'TX_DATA, 3', pin_signal: GPIO_B2_05, identifier: NETC_SWT_ETH2_TXD3, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A7, peripheral: NETC_SWT_ETH2, signal: TX_EN, pin_signal: GPIO_B2_08, identifier: NETC_SWT_ETH2_TXEN, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_NETC_SWT_ETH2_RGMII_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_NETC_SWT_ETH2_RGMII_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_02_NETC_PINMUX_ETH2_RXD02,  /* GPIO_B2_02 is configured as NETC_PINMUX_ETH2_RXD02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_03_NETC_PINMUX_ETH2_RXD03,  /* GPIO_B2_03 is configured as NETC_PINMUX_ETH2_RXD03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_04_NETC_PINMUX_ETH2_TXD02,  /* GPIO_B2_04 is configured as NETC_PINMUX_ETH2_TXD02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_05_NETC_PINMUX_ETH2_TXD03,  /* GPIO_B2_05 is configured as NETC_PINMUX_ETH2_TXD03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_06_NETC_PINMUX_ETH2_TXD00,  /* GPIO_B2_06 is configured as NETC_PINMUX_ETH2_TXD00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_07_NETC_PINMUX_ETH2_TXD01,  /* GPIO_B2_07 is configured as NETC_PINMUX_ETH2_TXD01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_08_NETC_PINMUX_ETH2_TX_EN,  /* GPIO_B2_08 is configured as NETC_PINMUX_ETH2_TX_EN */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_09_NETC_PINMUX_ETH2_TX_CLK,  /* GPIO_B2_09 is configured as NETC_PINMUX_ETH2_TX_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_10_NETC_PINMUX_ETH2_RXD00,  /* GPIO_B2_10 is configured as NETC_PINMUX_ETH2_RXD00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_11_NETC_PINMUX_ETH2_RXD01,  /* GPIO_B2_11 is configured as NETC_PINMUX_ETH2_RXD01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_12_NETC_PINMUX_ETH2_RX_DV,  /* GPIO_B2_12 is configured as NETC_PINMUX_ETH2_RX_DV */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_13_NETC_PINMUX_ETH2_RX_CLK,  /* GPIO_B2_13 is configured as NETC_PINMUX_ETH2_RX_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_02_NETC_PINMUX_ETH2_RXD02,  /* GPIO_B2_02 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_03_NETC_PINMUX_ETH2_RXD03,  /* GPIO_B2_03 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_04_NETC_PINMUX_ETH2_TXD02,  /* GPIO_B2_04 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_05_NETC_PINMUX_ETH2_TXD03,  /* GPIO_B2_05 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_06_NETC_PINMUX_ETH2_TXD00,  /* GPIO_B2_06 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_07_NETC_PINMUX_ETH2_TXD01,  /* GPIO_B2_07 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_08_NETC_PINMUX_ETH2_TX_EN,  /* GPIO_B2_08 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_09_NETC_PINMUX_ETH2_TX_CLK,  /* GPIO_B2_09 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_10_NETC_PINMUX_ETH2_RXD00,  /* GPIO_B2_10 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_11_NETC_PINMUX_ETH2_RXD01,  /* GPIO_B2_11 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_12_NETC_PINMUX_ETH2_RX_DV,  /* GPIO_B2_12 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_13_NETC_PINMUX_ETH2_RX_CLK,  /* GPIO_B2_13 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


