pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_NETC_ETH2_ETH3_PHY_Config_Pins:
- options: {callFromInitBoot: 'false', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: L17, peripheral: NETC, signal: netc_emdc, pin_signal: GPIO_AD_30, identifier: NETC_ETH2_ETH3_EMDC, software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
  - {pin_num: D14, peripheral: RGPIO5, signal: 'gpio_io, 06', pin_signal: GPIO_SD_B1_02, identifier: NETC_ETH2_ETH3_RESET, direction: OUTPUT, gpio_init_state: 'false',
    software_input_on: Disable, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: K17, peripheral: NETC, signal: netc_emdio, pin_signal: GPIO_AD_31, identifier: NETC_ETH2_ETH3_EMDIO, software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_NETC_ETH2_ETH3_PHY_Config_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_NETC_ETH2_ETH3_PHY_Config_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of NETC_ETH2_ETH3_RESET on GPIO_SD_B1_02 (pin D14) */
  rgpio_pin_config_t NETC_ETH2_ETH3_RESET_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_02 (pin D14) */
  RGPIO_PinInit(RGPIO5, 6U, &NETC_ETH2_ETH3_RESET_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_30_NETC_EMDC,            /* GPIO_AD_30 is configured as NETC_EMDC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_31_NETC_EMDIO,           /* GPIO_AD_31 is configured as NETC_EMDIO */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_02_GPIO5_IO06,        /* GPIO_SD_B1_02 is configured as GPIO5_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_30_NETC_EMDC,            /* GPIO_AD_30 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_31_NETC_EMDIO,           /* GPIO_AD_31 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B1_02_GPIO5_IO06,        /* GPIO_SD_B1_02 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_ECAT_PT0_MII_Pins:
- options: {callFromInitBoot: 'false', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: E1, peripheral: ECAT, signal: 'PT0_RXD, 0', pin_signal: GPIO_EMC_B1_09, identifier: ECAT_PT0_RXD0, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: E3, peripheral: ECAT, signal: 'PT0_RXD, 1', pin_signal: GPIO_EMC_B1_10, identifier: ECAT_PT0_RXD1, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: J4, peripheral: ECAT, signal: 'PT0_RXD, 2', pin_signal: GPIO_EMC_B1_04, identifier: ECAT_PT0_RXD2, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: G3, peripheral: ECAT, signal: 'PT0_RXD, 3', pin_signal: GPIO_EMC_B1_03, identifier: ECAT_PT0_RXD3, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: K2, peripheral: ECAT, signal: PT0_RX_CLK, pin_signal: GPIO_EMC_B1_02, identifier: ECAT_PT0_RXCLK, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: F2, peripheral: ECAT, signal: PT0_RX_DV, pin_signal: GPIO_EMC_B1_11, identifier: ECAT_PT0_RXEN, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: G6, peripheral: ECAT, signal: PT0_RX_ER, pin_signal: GPIO_EMC_B1_12, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: H5, peripheral: ECAT, signal: PT0_TX_CLK, pin_signal: GPIO_EMC_B1_08, identifier: ECAT_PT0_TXCLK, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: M3, peripheral: ECAT, signal: PT0_TX_EN, pin_signal: GPIO_EMC_B1_07, identifier: ECAT_PT0_TXEN, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: H6, peripheral: ECAT, signal: 'PT0_TXD, 0', pin_signal: GPIO_EMC_B1_05, identifier: ECAT_PT0_TXD0, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: K3, peripheral: ECAT, signal: 'PT0_TXD, 1', pin_signal: GPIO_EMC_B1_06, identifier: ECAT_PT0_TXD1, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: H4, peripheral: ECAT, signal: 'PT0_TXD, 2', pin_signal: GPIO_EMC_B1_01, identifier: ECAT_PT0_TXD2, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: H3, peripheral: ECAT, signal: 'PT0_TXD, 3', pin_signal: GPIO_EMC_B1_00, identifier: ECAT_PT0_TXD3, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: N17, peripheral: ECAT, signal: 'LINK_MII, 0', pin_signal: GPIO_AD_16, identifier: ECAT_PT0_LINK_MII, software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

