pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_ECAT_PT1_MII_Pins:
- options: {callFromInitBoot: 'false', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: A10, peripheral: ECAT, signal: 'PT1_RXD, 0', pin_signal: GPIO_B2_10, identifier: ECAT_PT1_RXD0, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: B9, peripheral: ECAT, signal: 'PT1_RXD, 1', pin_signal: GPIO_B2_11, identifier: ECAT_PT1_RXD1, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: C10, peripheral: ECAT, signal: 'PT1_RXD, 2', pin_signal: GPIO_B2_02, identifier: ECAT_PT1_RXD2, software_input_on: Disable, pull_down_pull_up_config: Pull_Up,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: D9, peripheral: ECAT, signal: 'PT1_RXD, 3', pin_signal: GPIO_B2_03, identifier: ECAT_PT1_RXD3, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: B8, peripheral: ECAT, signal: PT1_RX_CLK, pin_signal: GPIO_B2_13, identifier: ECAT_PT1_RXCLK, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A8, peripheral: ECAT, signal: PT1_RX_DV, pin_signal: GPIO_B2_12, identifier: ECAT_PT1_RXEN, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: E10, peripheral: ECAT, signal: PT1_RX_ER, pin_signal: GPIO_B2_01, software_input_on: Disable, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: D10, peripheral: ECAT, signal: PT1_TX_CLK, pin_signal: GPIO_B2_09, identifier: ECAT_PT1_TXCLK, software_input_on: Disable, pull_down_pull_up_config: Pull_Up,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A7, peripheral: ECAT, signal: PT1_TX_EN, pin_signal: GPIO_B2_08, identifier: ECAT_PT1_TX_EN, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: E8, peripheral: ECAT, signal: 'PT1_TXD, 0', pin_signal: GPIO_B2_06, identifier: ECAT_PT1_TXD0, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A6, peripheral: ECAT, signal: 'PT1_TXD, 1', pin_signal: GPIO_B2_07, identifier: ECAT_PT1_TXD1, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: C9, peripheral: ECAT, signal: 'PT1_TXD, 2', pin_signal: GPIO_B2_04, identifier: ECAT_PT1_TXD2, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A9, peripheral: ECAT, signal: 'PT1_TXD, 3', pin_signal: GPIO_B2_05, identifier: ECAT_PT1_TXD3, software_input_on: Disable, pull_down_pull_up_config: Pull_Down,
    pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: M17, peripheral: ECAT, signal: 'LINK_MII, 1', pin_signal: GPIO_AD_17, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_ECAT_PT1_MII_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_ECAT_PT1_MII_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_17_ECAT_LINK_1,          /* GPIO_AD_17 is configured as ECAT_LINK_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_01_ECAT_RX_ER_1,         /* GPIO_B2_01 is configured as ECAT_RX_ER_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_02_ECAT_RX_DATA2_1,      /* GPIO_B2_02 is configured as ECAT_RX_DATA2_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_03_ECAT_RX_DATA3_1,      /* GPIO_B2_03 is configured as ECAT_RX_DATA3_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_04_ECAT_TX_DATA2_1,      /* GPIO_B2_04 is configured as ECAT_TX_DATA2_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_05_ECAT_TX_DATA3_1,      /* GPIO_B2_05 is configured as ECAT_TX_DATA3_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_06_ECAT_TX_DATA0_1,      /* GPIO_B2_06 is configured as ECAT_TX_DATA0_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_07_ECAT_TX_DATA1_1,      /* GPIO_B2_07 is configured as ECAT_TX_DATA1_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_08_ECAT_TX_EN_1,         /* GPIO_B2_08 is configured as ECAT_TX_EN_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_09_ECAT_TX_CLK_1,        /* GPIO_B2_09 is configured as ECAT_TX_CLK_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_10_ECAT_RX_DATA0_1,      /* GPIO_B2_10 is configured as ECAT_RX_DATA0_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_11_ECAT_RX_DATA1_1,      /* GPIO_B2_11 is configured as ECAT_RX_DATA1_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_12_ECAT_RX_DV_1,         /* GPIO_B2_12 is configured as ECAT_RX_DV_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_13_ECAT_RX_CLK_1,        /* GPIO_B2_13 is configured as ECAT_RX_CLK_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_17_ECAT_LINK_1,          /* GPIO_AD_17 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_01_ECAT_RX_ER_1,         /* GPIO_B2_01 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_02_ECAT_RX_DATA2_1,      /* GPIO_B2_02 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_03_ECAT_RX_DATA3_1,      /* GPIO_B2_03 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_04_ECAT_TX_DATA2_1,      /* GPIO_B2_04 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_05_ECAT_TX_DATA3_1,      /* GPIO_B2_05 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_06_ECAT_TX_DATA0_1,      /* GPIO_B2_06 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_07_ECAT_TX_DATA1_1,      /* GPIO_B2_07 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_08_ECAT_TX_EN_1,         /* GPIO_B2_08 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_09_ECAT_TX_CLK_1,        /* GPIO_B2_09 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_10_ECAT_RX_DATA0_1,      /* GPIO_B2_10 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_11_ECAT_RX_DATA1_1,      /* GPIO_B2_11 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_12_ECAT_RX_DV_1,         /* GPIO_B2_12 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_13_ECAT_RX_CLK_1,        /* GPIO_B2_13 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


