pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_ECAT_PT0_PT1_PHY_Config_Pins:
- options: {callFromInitBoot: 'false', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: L17, peripheral: ECAT, signal: MDC, pin_signal: GPIO_AD_30, identifier: ECAT_PT0_PT1_EMDC, software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
  - {pin_num: K17, peripheral: ECAT, signal: MDIO, pin_signal: GPIO_AD_31, identifier: ECAT_PT0_PT1_EMDIO, software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
  - {pin_num: D14, peripheral: RGPIO5, signal: 'gpio_io, 06', pin_signal: GPIO_SD_B1_02, identifier: ECAT_PT0_PT1_RESET, direction: OUTPUT, gpio_init_state: 'false',
    software_input_on: Disable, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_ECAT_PT0_PT1_PHY_Config_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_ECAT_PT0_PT1_PHY_Config_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of ECAT_PT0_PT1_RESET on GPIO_SD_B1_02 (pin D14) */
  rgpio_pin_config_t ECAT_PT0_PT1_RESET_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_02 (pin D14) */
  RGPIO_PinInit(RGPIO5, 6U, &ECAT_PT0_PT1_RESET_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_30_ECAT_MCLK,            /* GPIO_AD_30 is configured as ECAT_MCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_31_ECAT_MDIO,            /* GPIO_AD_31 is configured as ECAT_MDIO */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_02_GPIO5_IO06,        /* GPIO_SD_B1_02 is configured as GPIO5_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_30_ECAT_MCLK,            /* GPIO_AD_30 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_31_ECAT_MDIO,            /* GPIO_AD_31 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B1_02_GPIO5_IO06,        /* GPIO_SD_B1_02 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_FlexSPI2_HYPERRAM_Pins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: P1, peripheral: FLEXSPI2, signal: FLEXSPI_A_SS0_B, pin_signal: GPIO_EMC_B1_39, software_input_on: Disable, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: R1, peripheral: FLEXSPI2, signal: FLEXSPI_A_SCLK, pin_signal: GPIO_EMC_B1_41, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: L2, peripheral: FLEXSPI2, signal: FLEXSPI_B_SCLK, pin_signal: GPIO_EMC_B1_34, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: N2, peripheral: FLEXSPI2, signal: FLEXSPI_A_DQS, pin_signal: GPIO_EMC_B1_40, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: L1, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA0, pin_signal: GPIO_EMC_B1_35, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: M1, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA1, pin_signal: GPIO_EMC_B1_36, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: N1, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA2, pin_signal: GPIO_EMC_B1_37, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: M2, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA3, pin_signal: GPIO_EMC_B1_38, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: K1, peripheral: FLEXSPI2, signal: FLEXSPI_B_DATA0, pin_signal: GPIO_EMC_B1_33, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: J1, peripheral: FLEXSPI2, signal: FLEXSPI_B_DATA1, pin_signal: GPIO_EMC_B1_32, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: J2, peripheral: FLEXSPI2, signal: FLEXSPI_B_DATA2, pin_signal: GPIO_EMC_B1_31, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
  - {pin_num: H2, peripheral: FLEXSPI2, signal: FLEXSPI_B_DATA3, pin_signal: GPIO_EMC_B1_30, software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver,
    open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

