pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_FlexSPI2_HYPERRAM_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_FlexSPI2_HYPERRAM_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_30_FLEXSPI2_BUS2BIT_B_DATA03,  /* GPIO_EMC_B1_30 is configured as FLEXSPI2_BUS2BIT_B_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_31_FLEXSPI2_BUS2BIT_B_DATA02,  /* GPIO_EMC_B1_31 is configured as FLEXSPI2_BUS2BIT_B_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_32_FLEXSPI2_BUS2BIT_B_DATA01,  /* GPIO_EMC_B1_32 is configured as FLEXSPI2_BUS2BIT_B_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_33_FLEXSPI2_BUS2BIT_B_DATA00,  /* GPIO_EMC_B1_33 is configured as FLEXSPI2_BUS2BIT_B_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_34_FLEXSPI2_BUS2BIT_B_SCLK,  /* GPIO_EMC_B1_34 is configured as FLEXSPI2_BUS2BIT_B_SCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_35_FLEXSPI2_BUS2BIT_A_DATA00,  /* GPIO_EMC_B1_35 is configured as FLEXSPI2_BUS2BIT_A_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_36_FLEXSPI2_BUS2BIT_A_DATA01,  /* GPIO_EMC_B1_36 is configured as FLEXSPI2_BUS2BIT_A_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_37_FLEXSPI2_BUS2BIT_A_DATA02,  /* GPIO_EMC_B1_37 is configured as FLEXSPI2_BUS2BIT_A_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_38_FLEXSPI2_BUS2BIT_A_DATA03,  /* GPIO_EMC_B1_38 is configured as FLEXSPI2_BUS2BIT_A_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_39_FLEXSPI2_BUS2BIT_A_SS0_B,  /* GPIO_EMC_B1_39 is configured as FLEXSPI2_BUS2BIT_A_SS0_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_40_FLEXSPI2_BUS2BIT_A_DQS,  /* GPIO_EMC_B1_40 is configured as FLEXSPI2_BUS2BIT_A_DQS */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_41_FLEXSPI2_BUS2BIT_A_SCLK,  /* GPIO_EMC_B1_41 is configured as FLEXSPI2_BUS2BIT_A_SCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_30_FLEXSPI2_BUS2BIT_B_DATA03,  /* GPIO_EMC_B1_30 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_31_FLEXSPI2_BUS2BIT_B_DATA02,  /* GPIO_EMC_B1_31 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_32_FLEXSPI2_BUS2BIT_B_DATA01,  /* GPIO_EMC_B1_32 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_33_FLEXSPI2_BUS2BIT_B_DATA00,  /* GPIO_EMC_B1_33 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_34_FLEXSPI2_BUS2BIT_B_SCLK,  /* GPIO_EMC_B1_34 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_35_FLEXSPI2_BUS2BIT_A_DATA00,  /* GPIO_EMC_B1_35 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_36_FLEXSPI2_BUS2BIT_A_DATA01,  /* GPIO_EMC_B1_36 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_37_FLEXSPI2_BUS2BIT_A_DATA02,  /* GPIO_EMC_B1_37 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_38_FLEXSPI2_BUS2BIT_A_DATA03,  /* GPIO_EMC_B1_38 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_39_FLEXSPI2_BUS2BIT_A_SS0_B,  /* GPIO_EMC_B1_39 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_40_FLEXSPI2_BUS2BIT_A_DQS,  /* GPIO_EMC_B1_40 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_41_FLEXSPI2_BUS2BIT_A_SCLK,  /* GPIO_EMC_B1_41 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


