pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_CAN1_Pins:
- options: {callFromInitBoot: 'false', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: C5, peripheral: CAN1, signal: TX, pin_signal: GPIO_AON_16, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull, open_drain: Disable,
    drive_strength: High, slew_rate: Slow}
  - {pin_num: D6, peripheral: CAN1, signal: RX, pin_signal: GPIO_AON_17, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull, open_drain: Disable,
    drive_strength: High, slew_rate: Slow}
  - {pin_num: E6, peripheral: RGPIO1, signal: 'gpio_io, 18', pin_signal: GPIO_AON_18, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_CAN1_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_CAN1_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of CAN1_STBY on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_18 (pin E6) */
  rgpio_pin_config_t CAN1_STBY_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_18 (pin E6) */
  RGPIO_PinInit(RGPIO1, 18U, &CAN1_STBY_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_16_CAN1_TX,             /* GPIO_AON_16 is configured as CAN1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_17_CAN1_RX,             /* GPIO_AON_17 is configured as CAN1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_18_GPIO1_IO18,          /* GPIO_AON_18 is configured as GPIO1_IO18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_16_CAN1_TX,             /* GPIO_AON_16 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_17_CAN1_RX,             /* GPIO_AON_17 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_18_GPIO1_IO18,          /* GPIO_AON_18 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_LED_BUTTON_Pins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: B3, peripheral: RGPIO1, signal: 'gpio_io, 15', pin_signal: GPIO_AON_15, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: C8, peripheral: RGPIO1, signal: 'gpio_io, 03', pin_signal: GPIO_AON_03, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: E9, peripheral: RGPIO6, signal: 'gpio_io, 14', pin_signal: GPIO_B2_00, direction: INPUT, gpio_interrupt: kGPIO_InterruptFallingEdge, gpio_interrupt_output: kRGPIO_InterruptOutput0,
    software_input_on: Disable, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: B5, peripheral: RGPIO1, signal: 'gpio_io, 10', pin_signal: GPIO_AON_10, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_LED_BUTTON_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_LED_BUTTON_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of LED_RED on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_03 (pin C8) */
  rgpio_pin_config_t LED_RED_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_03 (pin C8) */
  RGPIO_PinInit(RGPIO1, 3U, &LED_RED_config);

  /* GPIO configuration of LED_BLUE on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_10 (pin B5) */
  rgpio_pin_config_t LED_BLUE_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_10 (pin B5) */
  RGPIO_PinInit(RGPIO1, 10U, &LED_BLUE_config);

  /* GPIO configuration of LED_GREEN on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_15 (pin B3) */
  rgpio_pin_config_t LED_GREEN_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_15 (pin B3) */
  RGPIO_PinInit(RGPIO1, 15U, &LED_GREEN_config);

  /* GPIO configuration of USER_BUTTON on GPIO_B2_00 (pin E9) */
  rgpio_pin_config_t USER_BUTTON_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_B2_00 (pin E9) */
  RGPIO_PinInit(RGPIO6, 14U, &USER_BUTTON_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_B2_00 (pin E9) */
  RGPIO_SetPinInterruptConfig(RGPIO6, 14U, kRGPIO_InterruptOutput0, kRGPIO_InterruptFallingEdge);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_00_GPIO6_IO14,           /* GPIO_B2_00 is configured as GPIO6_IO14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_03_GPIO1_IO03,          /* GPIO_AON_03 is configured as GPIO1_IO03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_10_GPIO1_IO10,          /* GPIO_AON_10 is configured as GPIO1_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_15_GPIO1_IO15,          /* GPIO_AON_15 is configured as GPIO1_IO15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B2_00_GPIO6_IO14,           /* GPIO_B2_00 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_03_GPIO1_IO03,          /* GPIO_AON_03 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_10_GPIO1_IO10,          /* GPIO_AON_10 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_15_GPIO1_IO15,          /* GPIO_AON_15 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
}


