pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_Digital_Input_Pins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: B10, peripheral: RGPIO6, signal: 'gpio_io, 06', pin_signal: GPIO_B1_06, direction: INPUT, gpio_interrupt: kRGPIO_InterruptOrDMADisabled, gpio_interrupt_output: kRGPIO_InterruptOutput0,
    software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: D13, peripheral: RGPIO6, signal: 'gpio_io, 07', pin_signal: GPIO_B1_07, direction: INPUT, gpio_interrupt: kRGPIO_InterruptOrDMADisabled, gpio_interrupt_output: kRGPIO_InterruptOutput0,
    software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: B14, peripheral: RGPIO6, signal: 'gpio_io, 08', pin_signal: GPIO_B1_08, direction: INPUT, gpio_interrupt: kRGPIO_InterruptOrDMADisabled, gpio_interrupt_output: kRGPIO_InterruptOutput0,
    software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A15, peripheral: RGPIO6, signal: 'gpio_io, 09', pin_signal: GPIO_B1_09, direction: INPUT, gpio_interrupt: kRGPIO_InterruptOrDMADisabled, gpio_interrupt_output: kRGPIO_InterruptOutput0,
    software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A13, peripheral: RGPIO6, signal: 'gpio_io, 10', pin_signal: GPIO_B1_10, direction: INPUT, gpio_interrupt: kRGPIO_InterruptOrDMADisabled, gpio_interrupt_output: kRGPIO_InterruptOutput0,
    software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: A11, peripheral: RGPIO6, signal: 'gpio_io, 12', pin_signal: GPIO_B1_12, direction: INPUT, gpio_interrupt: kRGPIO_InterruptOrDMADisabled, gpio_interrupt_output: kRGPIO_InterruptOutput0,
    software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: B11, peripheral: RGPIO6, signal: 'gpio_io, 13', pin_signal: GPIO_B1_13, direction: INPUT, gpio_interrupt: kRGPIO_InterruptOrDMADisabled, gpio_interrupt_output: kRGPIO_InterruptOutput0,
    software_input_on: Disable, pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_Digital_Input_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_Digital_Input_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of DIGITAL_INPUT_05 on GPIO_B1_06 (pin B10) */
  rgpio_pin_config_t DIGITAL_INPUT_05_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_B1_06 (pin B10) */
  RGPIO_PinInit(RGPIO6, 6U, &DIGITAL_INPUT_05_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_B1_06 (pin B10) */
  RGPIO_SetPinInterruptConfig(RGPIO6, 6U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration of DIGITAL_INPUT_03 on GPIO_B1_07 (pin D13) */
  rgpio_pin_config_t DIGITAL_INPUT_03_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_B1_07 (pin D13) */
  RGPIO_PinInit(RGPIO6, 7U, &DIGITAL_INPUT_03_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_B1_07 (pin D13) */
  RGPIO_SetPinInterruptConfig(RGPIO6, 7U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration of DIGITAL_INPUT_02 on GPIO_B1_08 (pin B14) */
  rgpio_pin_config_t DIGITAL_INPUT_02_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_B1_08 (pin B14) */
  RGPIO_PinInit(RGPIO6, 8U, &DIGITAL_INPUT_02_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_B1_08 (pin B14) */
  RGPIO_SetPinInterruptConfig(RGPIO6, 8U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration of DIGITAL_INPUT_06 on GPIO_B1_09 (pin A15) */
  rgpio_pin_config_t DIGITAL_INPUT_06_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_B1_09 (pin A15) */
  RGPIO_PinInit(RGPIO6, 9U, &DIGITAL_INPUT_06_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_B1_09 (pin A15) */
  RGPIO_SetPinInterruptConfig(RGPIO6, 9U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration of DIGITAL_INPUT_07 on GPIO_B1_10 (pin A13) */
  rgpio_pin_config_t DIGITAL_INPUT_07_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_B1_10 (pin A13) */
  RGPIO_PinInit(RGPIO6, 10U, &DIGITAL_INPUT_07_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_B1_10 (pin A13) */
  RGPIO_SetPinInterruptConfig(RGPIO6, 10U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration of DIGITAL_INPUT_01 on GPIO_B1_12 (pin A11) */
  rgpio_pin_config_t DIGITAL_INPUT_01_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_B1_12 (pin A11) */
  RGPIO_PinInit(RGPIO6, 12U, &DIGITAL_INPUT_01_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_B1_12 (pin A11) */
  RGPIO_SetPinInterruptConfig(RGPIO6, 12U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration of DIGITAL_INPUT_04 on GPIO_B1_13 (pin B11) */
  rgpio_pin_config_t DIGITAL_INPUT_04_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_B1_13 (pin B11) */
  RGPIO_PinInit(RGPIO6, 13U, &DIGITAL_INPUT_04_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_B1_13 (pin B11) */
  RGPIO_SetPinInterruptConfig(RGPIO6, 13U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_06_GPIO6_IO06,           /* GPIO_B1_06 is configured as GPIO6_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_07_GPIO6_IO07,           /* GPIO_B1_07 is configured as GPIO6_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_08_GPIO6_IO08,           /* GPIO_B1_08 is configured as GPIO6_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_09_GPIO6_IO09,           /* GPIO_B1_09 is configured as GPIO6_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_10_GPIO6_IO10,           /* GPIO_B1_10 is configured as GPIO6_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_12_GPIO6_IO12,           /* GPIO_B1_12 is configured as GPIO6_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_13_GPIO6_IO13,           /* GPIO_B1_13 is configured as GPIO6_IO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_06_GPIO6_IO06,           /* GPIO_B1_06 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_07_GPIO6_IO07,           /* GPIO_B1_07 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_08_GPIO6_IO08,           /* GPIO_B1_08 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_09_GPIO6_IO09,           /* GPIO_B1_09 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_10_GPIO6_IO10,           /* GPIO_B1_10 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_12_GPIO6_IO12,           /* GPIO_B1_12 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_B1_13_GPIO6_IO13,           /* GPIO_B1_13 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


