pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_Digital_Output_Pins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: K4, peripheral: RGPIO2, signal: 'gpio_io, 21', pin_signal: GPIO_EMC_B1_21, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: L3, peripheral: RGPIO2, signal: 'gpio_io, 22', pin_signal: GPIO_EMC_B1_22, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: F1, peripheral: RGPIO2, signal: 'gpio_io, 23', pin_signal: GPIO_EMC_B1_23, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: P2, peripheral: RGPIO2, signal: 'gpio_io, 24', pin_signal: GPIO_EMC_B1_24, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: N3, peripheral: RGPIO2, signal: 'gpio_io, 25', pin_signal: GPIO_EMC_B1_25, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: N4, peripheral: RGPIO2, signal: 'gpio_io, 26', pin_signal: GPIO_EMC_B1_26, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: J3, peripheral: RGPIO2, signal: 'gpio_io, 27', pin_signal: GPIO_EMC_B1_27, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: F5, peripheral: RGPIO2, signal: 'gpio_io, 28', pin_signal: GPIO_EMC_B1_28, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: Pull_Down, pdrv_config: High_Driver, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_Digital_Output_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_Digital_Output_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of DIGITAL_OUTPUT_01 on GPIO_EMC_B1_21 (pin K4) */
  rgpio_pin_config_t DIGITAL_OUTPUT_01_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_21 (pin K4) */
  RGPIO_PinInit(RGPIO2, 21U, &DIGITAL_OUTPUT_01_config);

  /* GPIO configuration of DIGITAL_OUTPUT_02 on GPIO_EMC_B1_22 (pin L3) */
  rgpio_pin_config_t DIGITAL_OUTPUT_02_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_22 (pin L3) */
  RGPIO_PinInit(RGPIO2, 22U, &DIGITAL_OUTPUT_02_config);

  /* GPIO configuration of DIGITAL_OUTPUT_03 on GPIO_EMC_B1_23 (pin F1) */
  rgpio_pin_config_t DIGITAL_OUTPUT_03_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_23 (pin F1) */
  RGPIO_PinInit(RGPIO2, 23U, &DIGITAL_OUTPUT_03_config);

  /* GPIO configuration of DIGITAL_OUTPUT_04 on GPIO_EMC_B1_24 (pin P2) */
  rgpio_pin_config_t DIGITAL_OUTPUT_04_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_24 (pin P2) */
  RGPIO_PinInit(RGPIO2, 24U, &DIGITAL_OUTPUT_04_config);

  /* GPIO configuration of DIGITAL_OUTPUT_05 on GPIO_EMC_B1_25 (pin N3) */
  rgpio_pin_config_t DIGITAL_OUTPUT_05_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_25 (pin N3) */
  RGPIO_PinInit(RGPIO2, 25U, &DIGITAL_OUTPUT_05_config);

  /* GPIO configuration of DIGITAL_OUTPUT_06 on GPIO_EMC_B1_26 (pin N4) */
  rgpio_pin_config_t DIGITAL_OUTPUT_06_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_26 (pin N4) */
  RGPIO_PinInit(RGPIO2, 26U, &DIGITAL_OUTPUT_06_config);

  /* GPIO configuration of DIGITAL_OUTPUT_07 on GPIO_EMC_B1_27 (pin J3) */
  rgpio_pin_config_t DIGITAL_OUTPUT_07_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_27 (pin J3) */
  RGPIO_PinInit(RGPIO2, 27U, &DIGITAL_OUTPUT_07_config);

  /* GPIO configuration of DIGITAL_OUTPUT_08 on GPIO_EMC_B1_28 (pin F5) */
  rgpio_pin_config_t DIGITAL_OUTPUT_08_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_28 (pin F5) */
  RGPIO_PinInit(RGPIO2, 28U, &DIGITAL_OUTPUT_08_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_21_GPIO2_IO21,       /* GPIO_EMC_B1_21 is configured as GPIO2_IO21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_22_GPIO2_IO22,       /* GPIO_EMC_B1_22 is configured as GPIO2_IO22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_23_GPIO2_IO23,       /* GPIO_EMC_B1_23 is configured as GPIO2_IO23 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_24_GPIO2_IO24,       /* GPIO_EMC_B1_24 is configured as GPIO2_IO24 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_25_GPIO2_IO25,       /* GPIO_EMC_B1_25 is configured as GPIO2_IO25 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_26_GPIO2_IO26,       /* GPIO_EMC_B1_26 is configured as GPIO2_IO26 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_27_GPIO2_IO27,       /* GPIO_EMC_B1_27 is configured as GPIO2_IO27 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_28_GPIO2_IO28,       /* GPIO_EMC_B1_28 is configured as GPIO2_IO28 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_21_GPIO2_IO21,       /* GPIO_EMC_B1_21 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_22_GPIO2_IO22,       /* GPIO_EMC_B1_22 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_23_GPIO2_IO23,       /* GPIO_EMC_B1_23 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_24_GPIO2_IO24,       /* GPIO_EMC_B1_24 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_25_GPIO2_IO25,       /* GPIO_EMC_B1_25 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_26_GPIO2_IO26,       /* GPIO_EMC_B1_26 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_27_GPIO2_IO27,       /* GPIO_EMC_B1_27 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_28_GPIO2_IO28,       /* GPIO_EMC_B1_28 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}


