pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_AFE_Pins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: C7, peripheral: RGPIO1, signal: 'gpio_io, 05', pin_signal: GPIO_AON_05, identifier: AFE_CS, direction: OUTPUT, gpio_init_state: 'true', software_input_on: Disable,
    pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: B4, peripheral: LPSPI1, signal: SCK, pin_signal: GPIO_AON_04, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: E7, peripheral: LPSPI1, signal: SOUT, pin_signal: GPIO_AON_06, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: C6, peripheral: LPSPI1, signal: SIN, pin_signal: GPIO_AON_07, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: N16, peripheral: RGPIO4, signal: 'gpio_io, 15', pin_signal: GPIO_AD_15, identifier: AFE_DRDY, direction: INPUT, gpio_interrupt: kRGPIO_InterruptOrDMADisabled,
    gpio_interrupt_output: kRGPIO_InterruptOutput0, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High,
    slew_rate: Slow, force_ibe_off: Disable}
  - {pin_num: B15, peripheral: RGPIO5, signal: 'gpio_io, 08', pin_signal: GPIO_SD_B1_04, identifier: AFE_RST, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver, open_drain: Disable}
  - {pin_num: C15, peripheral: RGPIO5, signal: 'gpio_io, 07', pin_signal: GPIO_SD_B1_03, identifier: AFE_SYNC, direction: OUTPUT, gpio_init_state: 'false', software_input_on: Disable,
    pull_down_pull_up_config: No_Pull, pdrv_config: High_Driver, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_AFE_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_AFE_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of AFE_CS on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_05 (pin C7) */
  rgpio_pin_config_t AFE_CS_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 1U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_05 (pin C7) */
  RGPIO_PinInit(RGPIO1, 5U, &AFE_CS_config);

  /* GPIO configuration of AFE_DRDY on GPIO_AD_15 (pin N16) */
  rgpio_pin_config_t AFE_DRDY_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_AD_15 (pin N16) */
  RGPIO_PinInit(RGPIO4, 15U, &AFE_DRDY_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_AD_15 (pin N16) */
  RGPIO_SetPinInterruptConfig(RGPIO4, 15U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration of AFE_SYNC on GPIO_SD_B1_03 (pin C15) */
  rgpio_pin_config_t AFE_SYNC_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_03 (pin C15) */
  RGPIO_PinInit(RGPIO5, 7U, &AFE_SYNC_config);

  /* GPIO configuration of AFE_RST on GPIO_SD_B1_04 (pin B15) */
  rgpio_pin_config_t AFE_RST_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_SD_B1_04 (pin B15) */
  RGPIO_PinInit(RGPIO5, 8U, &AFE_RST_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_15_GPIO4_IO15,           /* GPIO_AD_15 is configured as GPIO4_IO15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_03_GPIO5_IO07,        /* GPIO_SD_B1_03 is configured as GPIO5_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B1_04_GPIO5_IO08,        /* GPIO_SD_B1_04 is configured as GPIO5_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_04_LPSPI1_SCK,          /* GPIO_AON_04 is configured as LPSPI1_SCK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_05_GPIO1_IO05,          /* GPIO_AON_05 is configured as GPIO1_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_06_LPSPI1_SDO,          /* GPIO_AON_06 is configured as LPSPI1_SDO */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_07_LPSPI1_SDI,          /* GPIO_AON_07 is configured as LPSPI1_SDI */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_15_GPIO4_IO15,           /* GPIO_AD_15 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B1_03_GPIO5_IO07,        /* GPIO_SD_B1_03 PAD functional properties : */
      0x0CU);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B1_04_GPIO5_IO08,        /* GPIO_SD_B1_04 PAD functional properties : */
      0x0CU);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_04_LPSPI1_SCK,          /* GPIO_AON_04 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_05_GPIO1_IO05,          /* GPIO_AON_05 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_06_LPSPI1_SDO,          /* GPIO_AON_06 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_07_LPSPI1_SDI,          /* GPIO_AON_07 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
}


