pesaventoeil/rd-riop/common/m33/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_PWM_Pins:
- options: {callFromInitBoot: 'true', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: M14, peripheral: PWM2, signal: 'A, 1', pin_signal: GPIO_AD_26, identifier: FLEXPWM_2_1A, direction: OUTPUT, software_input_on: Disable, pull_up_down_config: Pull_Down,
    pull_keeper_select: Pull, open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
  - {pin_num: M16, peripheral: PWM2, signal: 'B, 1', pin_signal: GPIO_AD_27, direction: OUTPUT, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
  - {pin_num: L16, peripheral: PWM2, signal: 'B, 2', pin_signal: GPIO_AD_28, direction: OUTPUT, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
  - {pin_num: L15, peripheral: PWM2, signal: 'A, 2', pin_signal: GPIO_AD_29, direction: OUTPUT, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_PWM_Pins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_PWM_Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_26_FLEXPWM2_PWMA01,      /* GPIO_AD_26 is configured as FLEXPWM2_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_27_FLEXPWM2_PWMB01,      /* GPIO_AD_27 is configured as FLEXPWM2_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_28_FLEXPWM2_PWMB02,      /* GPIO_AD_28 is configured as FLEXPWM2_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_29_FLEXPWM2_PWMA02,      /* GPIO_AD_29 is configured as FLEXPWM2_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_26_FLEXPWM2_PWMA01,      /* GPIO_AD_26 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_27_FLEXPWM2_PWMB01,      /* GPIO_AD_27 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_28_FLEXPWM2_PWMB02,      /* GPIO_AD_28 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_29_FLEXPWM2_PWMA02,      /* GPIO_AD_29 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_ECAT_I2C_Pins:
- options: {callFromInitBoot: 'false', prefix: '', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: K16, peripheral: ECAT, signal: SCL, pin_signal: GPIO_AD_18, software_input_on: Disable, pull_up_down_config: Pull_Up, pull_keeper_select: Pull, open_drain: Disable,
    drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
  - {pin_num: L13, peripheral: ECAT, signal: SDA, pin_signal: GPIO_AD_19, software_input_on: Disable, pull_up_down_config: Pull_Up, pull_keeper_select: Pull, open_drain: Disable,
    drive_strength: High, slew_rate: Slow, force_ibe_off: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

